MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024EFF124/mcu.h
#define _ADCDATA5_DATA_POSITION                  0x00000000
#define _ADCDATA5_DATA_MASK                      0xFFFFFFFF
#define _ADCDATA5_DATA_LENGTH                    0x00000020

#define _ADCDATA6_DATA_POSITION                  0x00000000
#define _ADCDATA6_DATA_MASK                      0xFFFFFFFF
#define _ADCDATA6_DATA_LENGTH                    0x00000020

#define _ADCDATA7_DATA_POSITION                  0x00000000
#define _ADCDATA7_DATA_MASK                      0xFFFFFFFF
#define _ADCDATA7_DATA_LENGTH                    0x00000020

#define _ADCDATA8_DATA_POSITION                  0x00000000
#define _ADCDATA8_DATA_MASK                      0xFFFFFFFF
#define _ADCDATA8_DATA_LENGTH                    0x00000020

#define _ADCDATA9_DATA_POSITION                  0x00000000
#define _ADCDATA9_DATA_MASK                      0xFFFFFFFF
#define _ADCDATA9_DATA_LENGTH                    0x00000020

#define _ADCDATA10_DATA_POSITION                 0x00000000
#define _ADCDATA10_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA10_DATA_LENGTH                   0x00000020

#define _ADCDATA11_DATA_POSITION                 0x00000000
#define _ADCDATA11_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA11_DATA_LENGTH                   0x00000020

#define _ADCDATA12_DATA_POSITION                 0x00000000
#define _ADCDATA12_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA12_DATA_LENGTH                   0x00000020

#define _ADCDATA13_DATA_POSITION                 0x00000000
#define _ADCDATA13_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA13_DATA_LENGTH                   0x00000020

#define _ADCDATA14_DATA_POSITION                 0x00000000
#define _ADCDATA14_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA14_DATA_LENGTH                   0x00000020

#define _ADCDATA15_DATA_POSITION                 0x00000000
#define _ADCDATA15_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA15_DATA_LENGTH                   0x00000020

#define _ADCDATA16_DATA_POSITION                 0x00000000
#define _ADCDATA16_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA16_DATA_LENGTH                   0x00000020

#define _ADCDATA17_DATA_POSITION                 0x00000000
#define _ADCDATA17_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA17_DATA_LENGTH                   0x00000020

#define _ADCDATA18_DATA_POSITION                 0x00000000
#define _ADCDATA18_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA18_DATA_LENGTH                   0x00000020

#define _ADCDATA19_DATA_POSITION                 0x00000000
#define _ADCDATA19_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA19_DATA_LENGTH                   0x00000020

#define _ADCDATA20_DATA_POSITION                 0x00000000
#define _ADCDATA20_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA20_DATA_LENGTH                   0x00000020

#define _ADCDATA21_DATA_POSITION                 0x00000000
#define _ADCDATA21_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA21_DATA_LENGTH                   0x00000020

#define _ADCDATA22_DATA_POSITION                 0x00000000
#define _ADCDATA22_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA22_DATA_LENGTH                   0x00000020

#define _ADCDATA23_DATA_POSITION                 0x00000000
#define _ADCDATA23_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA23_DATA_LENGTH                   0x00000020

#define _ADCDATA24_DATA_POSITION                 0x00000000
#define _ADCDATA24_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA24_DATA_LENGTH                   0x00000020

#define _ADCDATA25_DATA_POSITION                 0x00000000
#define _ADCDATA25_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA25_DATA_LENGTH                   0x00000020

#define _ADCDATA26_DATA_POSITION                 0x00000000
#define _ADCDATA26_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA26_DATA_LENGTH                   0x00000020

#define _ADCDATA27_DATA_POSITION                 0x00000000
#define _ADCDATA27_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA27_DATA_LENGTH                   0x00000020

#define _ADCDATA28_DATA_POSITION                 0x00000000
#define _ADCDATA28_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA28_DATA_LENGTH                   0x00000020

#define _ADCDATA29_DATA_POSITION                 0x00000000
#define _ADCDATA29_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA29_DATA_LENGTH                   0x00000020

#define _ADCDATA30_DATA_POSITION                 0x00000000
#define _ADCDATA30_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA30_DATA_LENGTH                   0x00000020

#define _ADCDATA31_DATA_POSITION                 0x00000000
#define _ADCDATA31_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA31_DATA_LENGTH                   0x00000020

#define _ADCDATA32_DATA_POSITION                 0x00000000
#define _ADCDATA32_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA32_DATA_LENGTH                   0x00000020

#define _ADCDATA33_DATA_POSITION                 0x00000000
#define _ADCDATA33_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA33_DATA_LENGTH                   0x00000020

#define _ADCDATA34_DATA_POSITION                 0x00000000
#define _ADCDATA34_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA34_DATA_LENGTH                   0x00000020

#define _ADCDATA35_DATA_POSITION                 0x00000000
#define _ADCDATA35_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA35_DATA_LENGTH                   0x00000020

#define _ADCDATA36_DATA_POSITION                 0x00000000
#define _ADCDATA36_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA36_DATA_LENGTH                   0x00000020

#define _ADCDATA37_DATA_POSITION                 0x00000000
#define _ADCDATA37_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA37_DATA_LENGTH                   0x00000020

#define _ADCDATA38_DATA_POSITION                 0x00000000
#define _ADCDATA38_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA38_DATA_LENGTH                   0x00000020

#define _ADCDATA39_DATA_POSITION                 0x00000000
#define _ADCDATA39_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA39_DATA_LENGTH                   0x00000020

