MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024EFF124/mcu.h
#define _CNSTATJ_CNSTATJ3_POSITION               0x00000003
#define _CNSTATJ_CNSTATJ3_MASK                   0x00000008
#define _CNSTATJ_CNSTATJ3_LENGTH                 0x00000001

#define _CNSTATJ_CNSTATJ5_POSITION               0x00000005
#define _CNSTATJ_CNSTATJ5_MASK                   0x00000020
#define _CNSTATJ_CNSTATJ5_LENGTH                 0x00000001

#define _CNSTATJ_CNSTATJ9_POSITION               0x00000009
#define _CNSTATJ_CNSTATJ9_MASK                   0x00000200
#define _CNSTATJ_CNSTATJ9_LENGTH                 0x00000001

#define _CNSTATJ_CNSTATJ11_POSITION              0x0000000B
#define _CNSTATJ_CNSTATJ11_MASK                  0x00000800
#define _CNSTATJ_CNSTATJ11_LENGTH                0x00000001

#define _CNSTATJ_w_POSITION                      0x00000000
#define _CNSTATJ_w_MASK                          0xFFFFFFFF
#define _CNSTATJ_w_LENGTH                        0x00000020

#define _CNNEJ_CNNEJ0_POSITION                   0x00000000
#define _CNNEJ_CNNEJ0_MASK                       0x00000001
#define _CNNEJ_CNNEJ0_LENGTH                     0x00000001

#define _CNNEJ_CNNEJ1_POSITION                   0x00000001
#define _CNNEJ_CNNEJ1_MASK                       0x00000002
#define _CNNEJ_CNNEJ1_LENGTH                     0x00000001

#define _CNNEJ_CNNEJ2_POSITION                   0x00000002
#define _CNNEJ_CNNEJ2_MASK                       0x00000004
#define _CNNEJ_CNNEJ2_LENGTH                     0x00000001

#define _CNNEJ_CNNEJ4_POSITION                   0x00000004
#define _CNNEJ_CNNEJ4_MASK                       0x00000010
#define _CNNEJ_CNNEJ4_LENGTH                     0x00000001

#define _CNNEJ_CNNEJ8_POSITION                   0x00000008
#define _CNNEJ_CNNEJ8_MASK                       0x00000100
#define _CNNEJ_CNNEJ8_LENGTH                     0x00000001

#define _CNNEJ_CNNEJ9_POSITION                   0x00000009
#define _CNNEJ_CNNEJ9_MASK                       0x00000200
#define _CNNEJ_CNNEJ9_LENGTH                     0x00000001

#define _CNNEJ_CNNEJ11_POSITION                  0x0000000B
#define _CNNEJ_CNNEJ11_MASK                      0x00000800
#define _CNNEJ_CNNEJ11_LENGTH                    0x00000001

#define _CNFJ_CNFJ0_POSITION                     0x00000000
#define _CNFJ_CNFJ0_MASK                         0x00000001
#define _CNFJ_CNFJ0_LENGTH                       0x00000001

#define _CNFJ_CNFJ1_POSITION                     0x00000001
#define _CNFJ_CNFJ1_MASK                         0x00000002
#define _CNFJ_CNFJ1_LENGTH                       0x00000001

#define _CNFJ_CNFJ2_POSITION                     0x00000002
#define _CNFJ_CNFJ2_MASK                         0x00000004
#define _CNFJ_CNFJ2_LENGTH                       0x00000001

#define _CNFJ_CNFJ4_POSITION                     0x00000004
#define _CNFJ_CNFJ4_MASK                         0x00000010
#define _CNFJ_CNFJ4_LENGTH                       0x00000001

#define _CNFJ_CNFJ8_POSITION                     0x00000008
#define _CNFJ_CNFJ8_MASK                         0x00000100
#define _CNFJ_CNFJ8_LENGTH                       0x00000001

#define _CNFJ_CNFJ9_POSITION                     0x00000009
#define _CNFJ_CNFJ9_MASK                         0x00000200
#define _CNFJ_CNFJ9_LENGTH                       0x00000001

#define _CNFJ_CNFJ11_POSITION                    0x0000000B
#define _CNFJ_CNFJ11_MASK                        0x00000800
#define _CNFJ_CNFJ11_LENGTH                      0x00000001

#define _C1CON_DNCNT_POSITION                    0x00000000
#define _C1CON_DNCNT_MASK                        0x0000001F
#define _C1CON_DNCNT_LENGTH                      0x00000005

#define _C1CON_CANBUSY_POSITION                  0x0000000B
#define _C1CON_CANBUSY_MASK                      0x00000800
#define _C1CON_CANBUSY_LENGTH                    0x00000001

#define _C1CON_SIDL_POSITION                     0x0000000D
#define _C1CON_SIDL_MASK                         0x00002000
#define _C1CON_SIDL_LENGTH                       0x00000001

#define _C1CON_ON_POSITION                       0x0000000F
#define _C1CON_ON_MASK                           0x00008000
#define _C1CON_ON_LENGTH                         0x00000001

#define _C1CON_CANCAP_POSITION                   0x00000014
#define _C1CON_CANCAP_MASK                       0x00100000
#define _C1CON_CANCAP_LENGTH                     0x00000001

#define _C1CON_OPMOD_POSITION                    0x00000015
#define _C1CON_OPMOD_MASK                        0x00E00000
#define _C1CON_OPMOD_LENGTH                      0x00000003

#define _C1CON_REQOP_POSITION                    0x00000018
#define _C1CON_REQOP_MASK                        0x07000000
#define _C1CON_REQOP_LENGTH                      0x00000003

#define _C1CON_ABAT_POSITION                     0x0000001B
#define _C1CON_ABAT_MASK                         0x08000000
#define _C1CON_ABAT_LENGTH                       0x00000001

#define _C1CON_w_POSITION                        0x00000000
#define _C1CON_w_MASK                            0xFFFFFFFF
#define _C1CON_w_LENGTH                          0x00000020

#define _C1CFG_BRP_POSITION                      0x00000000
#define _C1CFG_BRP_MASK                          0x0000003F
#define _C1CFG_BRP_LENGTH                        0x00000006

#define _C1CFG_SJW_POSITION                      0x00000006
#define _C1CFG_SJW_MASK                          0x000000C0
#define _C1CFG_SJW_LENGTH                        0x00000002

#define _C1CFG_PRSEG_POSITION                    0x00000008
#define _C1CFG_PRSEG_MASK                        0x00000700
#define _C1CFG_PRSEG_LENGTH                      0x00000003

#define _C1CFG_SEG1PH_POSITION                   0x0000000B
#define _C1CFG_SEG1PH_MASK                       0x00003800
#define _C1CFG_SEG1PH_LENGTH                     0x00000003

#define _C1CFG_SAM_POSITION                      0x0000000E
#define _C1CFG_SAM_MASK                          0x00004000
#define _C1CFG_SAM_LENGTH                        0x00000001

#define _C1CFG_SEG2PHTS_POSITION                 0x0000000F
#define _C1CFG_SEG2PHTS_MASK                     0x00008000
#define _C1CFG_SEG2PHTS_LENGTH                   0x00000001

#define _C1CFG_SEG2PH_POSITION                   0x00000010
#define _C1CFG_SEG2PH_MASK                       0x00070000
#define _C1CFG_SEG2PH_LENGTH                     0x00000003

#define _C1CFG_WAKFIL_POSITION                   0x00000016
#define _C1CFG_WAKFIL_MASK                       0x00400000
#define _C1CFG_WAKFIL_LENGTH                     0x00000001

#define _C1CFG_w_POSITION                        0x00000000
#define _C1CFG_w_MASK                            0xFFFFFFFF
#define _C1CFG_w_LENGTH                          0x00000020

#define _C1INT_TBIF_POSITION                     0x00000000
#define _C1INT_TBIF_MASK                         0x00000001
#define _C1INT_TBIF_LENGTH                       0x00000001

#define _C1INT_RBIF_POSITION                     0x00000001
#define _C1INT_RBIF_MASK                         0x00000002
#define _C1INT_RBIF_LENGTH                       0x00000001

#define _C1INT_CTMRIF_POSITION                   0x00000002
#define _C1INT_CTMRIF_MASK                       0x00000004
#define _C1INT_CTMRIF_LENGTH                     0x00000001

